TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_gpio.h
//###########################################################################
//
// FILE:    hw_gpio.h
//
// TITLE:   Definitions for the GPIO registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_GPIO_H
#define HW_GPIO_H

//*************************************************************************************************
//
// The following are defines for the GPIO register offsets
//
//*************************************************************************************************
#define GPIO_O_GPACTRL    0x0U     // GPIO A Qualification Sampling Period Control (GPIO0 to 31)
#define GPIO_O_GPAQSEL1   0x4U     // GPIO A Qualifier Select 1 Register (GPIO0 to 15)
#define GPIO_O_GPAQSEL2   0x8U     // GPIO A Qualifier Select 2 Register (GPIO16 to 31)
#define GPIO_O_GPAMUX1    0xCU     // GPIO A Mux 1 Register (GPIO0 to 15)
#define GPIO_O_GPAMUX2    0x10U    // GPIO A Mux 2 Register (GPIO16 to 31)
#define GPIO_O_GPAPUD     0x18U    // GPIO A Pull Up Disable Register (GPIO0 to 31)
#define GPIO_O_GPAINV     0x20U    // GPIO A Input Polarity Invert Registers (GPIO0 to 31)
#define GPIO_O_GPAODR     0x24U    // GPIO A Open Drain Output Register (GPIO0 to GPIO31)
#define GPIO_O_GPAGMUX1   0x40U    // GPIO A Peripheral Group Mux (GPIO0 to 15)
#define GPIO_O_GPAGMUX2   0x44U    // GPIO A Peripheral Group Mux (GPIO16 to 31)
#define GPIO_O_GPACSEL1   0x50U    // GPIO A Core Select Register (GPIO0 to 7)
#define GPIO_O_GPACSEL2   0x54U    // GPIO A Core Select Register (GPIO8 to 15)
#define GPIO_O_GPACSEL3   0x58U    // GPIO A Core Select Register (GPIO16 to 23)
#define GPIO_O_GPACSEL4   0x5CU    // GPIO A Core Select Register (GPIO24 to 31)
#define GPIO_O_GPALOCK    0x78U    // GPIO A Lock Configuration Register (GPIO0 to 31)
#define GPIO_O_GPACR      0x7CU    // GPIO A Lock Commit Register (GPIO0 to 31)
#define GPIO_O_GPBCTRL    0x80U    // GPIO B Qualification Sampling Period Control (GPIO32 to 63)
#define GPIO_O_GPBQSEL1   0x84U    // GPIO B Qualifier Select 1 Register (GPIO32 to 47)
#define GPIO_O_GPBQSEL2   0x88U    // GPIO B Qualifier Select 2 Register (GPIO48 to 63)
#define GPIO_O_GPBMUX1    0x8CU    // GPIO B Mux 1 Register (GPIO32 to 47)
#define GPIO_O_GPBMUX2    0x90U    // GPIO B Mux 2 Register (GPIO48 to 63)
#define GPIO_O_GPBPUD     0x98U    // GPIO B Pull Up Disable Register (GPIO32 to 63)
#define GPIO_O_GPBINV     0xA0U    // GPIO B Input Polarity Invert Registers (GPIO32 to 63)
#define GPIO_O_GPBODR     0xA4U    // GPIO B Open Drain Output Register (GPIO32 to GPIO63)
#define GPIO_O_GPBGMUX1   0xC0U    // GPIO B Peripheral Group Mux (GPIO32 to 47)
#define GPIO_O_GPBGMUX2   0xC4U    // GPIO B Peripheral Group Mux (GPIO48 to 63)
#define GPIO_O_GPBCSEL1   0xD0U    // GPIO B Core Select Register (GPIO32 to 39)
#define GPIO_O_GPBCSEL2   0xD4U    // GPIO B Core Select Register (GPIO40 to 47)
#define GPIO_O_GPBCSEL3   0xD8U    // GPIO B Core Select Register (GPIO48 to 55)
#define GPIO_O_GPBCSEL4   0xDCU    // GPIO B Core Select Register (GPIO56 to 63)
#define GPIO_O_GPBLOCK    0xF8U    // GPIO B Lock Configuration Register (GPIO32 to 63)
#define GPIO_O_GPBCR      0xFCU    // GPIO B Lock Commit Register (GPIO32 to 63)
#define GPIO_O_GPCCTRL    0x100U   // GPIO C Qualification Sampling Period Control (GPIO64 to 95)
#define GPIO_O_GPCQSEL1   0x104U   // GPIO C Qualifier Select 1 Register (GPIO64 to 79)
#define GPIO_O_GPCQSEL2   0x108U   // GPIO C Qualifier Select 2 Register (GPIO80  to 95)
#define GPIO_O_GPCMUX1    0x10CU   // GPIO C Mux 1 Register (GPIO64 to 79)
#define GPIO_O_GPCMUX2    0x110U   // GPIO C Mux 2 Register (GPIO80  to 95)
#define GPIO_O_GPCPUD     0x118U   // GPIO C Pull Up Disable Register (GPIO64 to 95)
#define GPIO_O_GPCINV     0x120U   // GPIO C Input Polarity Invert Registers (GPIO64 to 95)
#define GPIO_O_GPCODR     0x124U   // GPIO C Open Drain Output Register (GPIO64 to GPIO95)
#define GPIO_O_GPCGMUX1   0x140U   // GPIO C Peripheral Group Mux (GPIO64 to 79)
#define GPIO_O_GPCGMUX2   0x144U   // GPIO C Peripheral Group Mux (GPIO80  to 95)
#define GPIO_O_GPCCSEL1   0x150U   // GPIO C Core Select Register (GPIO64 to 71)
#define GPIO_O_GPCCSEL2   0x154U   // GPIO C Core Select Register (GPIO72 to 79)
#define GPIO_O_GPCCSEL3   0x158U   // GPIO C Core Select Register (GPIO80  to 87)
#define GPIO_O_GPCCSEL4   0x15CU   // GPIO C Core Select Register (GPIO88 to 95)
#define GPIO_O_GPCLOCK    0x178U   // GPIO C Lock Configuration Register (GPIO64 to 95)
#define GPIO_O_GPCCR      0x17CU   // GPIO C Lock Commit Register (GPIO64 to 95)
#define GPIO_O_GPDCTRL    0x180U   // GPIO D Qualification Sampling Period Control (GPIO96 to 127)
#define GPIO_O_GPDQSEL1   0x184U   // GPIO D Qualifier Select 1 Register (GPIO96 to 111)
#define GPIO_O_GPDQSEL2   0x188U   // GPIO D Qualifier Select 2 Register (GPIO112 to 127)
#define GPIO_O_GPDMUX1    0x18CU   // GPIO D Mux 1 Register (GPIO96 to 111)
#define GPIO_O_GPDMUX2    0x190U   // GPIO D Mux 2 Register (GPIO112 to 127)
#define GPIO_O_GPDPUD     0x198U   // GPIO D Pull Up Disable Register (GPIO96 to 127)
#define GPIO_O_GPDINV     0x1A0U   // GPIO D Input Polarity Invert Registers (GPIO96 to 127)
#define GPIO_O_GPDODR     0x1A4U   // GPIO D Open Drain Output Register (GPIO96 to GPIO127)
#define GPIO_O_GPDGMUX1   0x1C0U   // GPIO D Peripheral Group Mux (GPIO96 to 111)
#define GPIO_O_GPDGMUX2   0x1C4U   // GPIO D Peripheral Group Mux (GPIO112 to 127)
#define GPIO_O_GPDCSEL1   0x1D0U   // GPIO D Core Select Register (GPIO96 to 103)
#define GPIO_O_GPDCSEL2   0x1D4U   // GPIO D Core Select Register (GPIO104 to 111)
#define GPIO_O_GPDCSEL4   0x1DCU   // GPIO D Core Select Register (GPIO120 to 127)
#define GPIO_O_GPDLOCK    0x1F8U   // GPIO D Lock Configuration Register (GPIO96 to 127)
#define GPIO_O_GPDCR      0x1FCU   // GPIO D Lock Commit Register (GPIO96 to 127)
#define GPIO_O_GPFCTRL    0x280U   // GPIO F Qualification Sampling Period Control (GPIO160 to 191)
#define GPIO_O_GPFQSEL1   0x284U   // GPIO F Qualifier Select 1 Register (GPIO160 to 168)
#define GPIO_O_GPFQSEL2   0x288U   // GPIO F Qualifier Select 2 Register (GPIO176 to 191)
#define GPIO_O_GPFMUX1    0x28CU   // GPIO F Mux 1 Register (GPIO160 to 175)
#define GPIO_O_GPFMUX2    0x290U   // GPIO F Mux 2 Register (GPIO176 to 191)
#define GPIO_O_GPFPUD     0x298U   // GPIO F Pull Up Disable Register (GPIO160 to 191)
#define GPIO_O_GPFINV     0x2A0U   // GPIO F Input Polarity Invert Registers (GPIO160 to 191)
#define GPIO_O_GPFAMSEL   0x2A8U   // GPIO F Analog Mode Select register (GPIO160 to GPIO191)
#define GPIO_O_GPFGMUX1   0x2C0U   // GPIO F Peripheral Group Mux (GPIO160 to 175)
#define GPIO_O_GPFGMUX2   0x2C4U   // GPIO F Peripheral Group Mux (GPIO176 to 191)
#define GPIO_O_GPFCSEL1   0x2D0U   // GPIO F Core Select Register (GPIO160 to 167)
#define GPIO_O_GPFCSEL2   0x2D4U   // GPIO F Core Select Register (GPIO168 to 175)
#define GPIO_O_GPFCSEL3   0x2D8U   // GPIO F Core Select Register (GPIO176 to 183)
#define GPIO_O_GPFCSEL4   0x2DCU   // GPIO F Core Select Register (GPIO184 to 191)
#define GPIO_O_GPFLOCK    0x2F8U   // GPIO F Lock Configuration Register (GPIO160 to 191)
#define GPIO_O_GPFCR      0x2FCU   // GPIO F Lock Commit Register (GPIO160 to 191)
#define GPIO_O_GPGCTRL    0x300U   // GPIO G Qualification Sampling Period Control (GPIO192 to 223)
#define GPIO_O_GPGQSEL1   0x304U   // GPIO G Qualifier Select 1 Register (GPIO192 to 207)
#define GPIO_O_GPGQSEL2   0x308U   // GPIO G Qualifier Select 2 Register (GPIO208 to 223)
#define GPIO_O_GPGMUX1    0x30CU   // GPIO G Mux 1 Register (GPIO192 to 207)
#define GPIO_O_GPGMUX2    0x310U   // GPIO G Mux 2 Register (GPIO208 to 223)
#define GPIO_O_GPGPUD     0x318U   // GPIO G Pull Up Disable Register (GPIO192 to 223)
#define GPIO_O_GPGINV     0x320U   // GPIO G Input Polarity Invert Registers (GPIO192 to 223)
#define GPIO_O_GPGODR     0x324U   // GPIO G Open Drain Output Register (GPIO192 to 223)
#define GPIO_O_GPGAMSEL   0x328U   // GPIO G Analog Mode Select register (GPIO192 to 223)
#define GPIO_O_GPGGMUX1   0x340U   // GPIO G Peripheral Group Mux (GPIO192 to 207)
#define GPIO_O_GPGGMUX2   0x344U   // GPIO G Peripheral Group Mux (GPIO208 to 223)
#define GPIO_O_GPGCSEL1   0x350U   // GPIO G Core Select Register (GPIO192 to 199)
#define GPIO_O_GPGCSEL2   0x354U   // GPIO G Core Select Register (GPIO200 to 207)
#define GPIO_O_GPGCSEL3   0x358U   // GPIO G Core Select Register (GPIO208 to 215)
#define GPIO_O_GPGCSEL4   0x35CU   // GPIO G Core Select Register (GPIO216 to 223)
#define GPIO_O_GPGLOCK    0x378U   // GPIO G Lock Configuration Register (GPIO192 to 223)
#define GPIO_O_GPGCR      0x37CU   // GPIO G Lock Commit Register (GPIO192 to 223)
#define GPIO_O_GPHCTRL    0x380U   // GPIO H Qualification Sampling Period Control (GPIO224 to 255)
#define GPIO_O_GPHQSEL1   0x384U   // GPIO H Qualifier Select 1 Register (GPIO224 to 239)
#define GPIO_O_GPHQSEL2   0x388U   // GPIO H Qualifier Select 2 Register (GPIO240 to 255)
#define GPIO_O_GPHMUX1    0x38CU   // GPIO H Mux 1 Register (GPIO224 to 239)
#define GPIO_O_GPHMUX2    0x390U   // GPIO H Mux 2 Register (GPIO240 to 255)
#define GPIO_O_GPHPUD     0x398U   // GPIO H Pull Up Disable Register (GPIO224 to 255)
#define GPIO_O_GPHINV     0x3A0U   // GPIO H Input Polarity Invert Registers (GPIO224 to 255)
#define GPIO_O_GPHODR     0x3A4U   // GPIO H Open Drain Output Register (GPIO224 to GPIO255)
#define GPIO_O_GPHAMSEL   0x3A8U   // GPIO H Analog Mode Select register (GPIO224 to GPIO255)
#define GPIO_O_GPHGMUX1   0x3C0U   // GPIO H Peripheral Group Mux (GPIO224 to 239)
#define GPIO_O_GPHGMUX2   0x3C4U   // GPIO H Peripheral Group Mux (GPIO240 to 255)
#define GPIO_O_GPHCSEL1   0x3D0U   // GPIO H Core Select Register (GPIO224 to 231)
#define GPIO_O_GPHCSEL2   0x3D4U   // GPIO H Core Select Register (GPIO232 to 239)
#define GPIO_O_GPHCSEL3   0x3D8U   // GPIO H Core Select Register (GPIO240 to 247)
#define GPIO_O_GPHCSEL4   0x3DCU   // GPIO H Core Select Register (GPIO248 to 255)
#define GPIO_O_GPHLOCK    0x3F8U   // GPIO H Lock Configuration Register (GPIO224 to 255)
#define GPIO_O_GPHCR      0x3FCU   // GPIO H Lock Commit Register (GPIO224 to 255)

#define GPIO_O_GPADAT      0x0U    // GPIO A Data Register (GPIO0 to 31)
#define GPIO_O_GPASET      0x4U    // GPIO A Data Set Register (GPIO0 to 31)
#define GPIO_O_GPACLEAR    0x8U    // GPIO A Data Clear Register (GPIO0 to 31)
#define GPIO_O_GPATOGGLE   0xCU    // GPIO A Data Toggle Register (GPIO0 to 31)
#define GPIO_O_GPADIR      0x10U   // GPIO A Direction Register (GPIO0 to 31)
#define GPIO_O_GPBDAT      0x14U   // GPIO B Data Register (GPIO32 to 63)
#define GPIO_O_GPBSET      0x18U   // GPIO B Data Set Register (GPIO32 to 63)
#define GPIO_O_GPBCLEAR    0x1CU   // GPIO B Data Clear Register (GPIO32 to 63)
#define GPIO_O_GPBTOGGLE   0x20U   // GPIO B Data Toggle Register (GPIO32 to 63)
#define GPIO_O_GPBDIR      0x24U   // GPIO B Direction Register (GPIO0 to 31)
#define GPIO_O_GPCDAT      0x28U   // GPIO C Data Register (GPIO64 to 95)
#define GPIO_O_GPCSET      0x2CU   // GPIO C Data Set Register (GPIO64 to 95)
#define GPIO_O_GPCCLEAR    0x30U   // GPIO C Data Clear Register (GPIO64 to 95)
#define GPIO_O_GPCTOGGLE   0x34U   // GPIO C Data Toggle Register (GPIO64 to 95)
#define GPIO_O_GPCDIR      0x38U   // GPIO C Direction Register (GPIO0 to 31)
#define GPIO_O_GPDDAT      0x3CU   // GPIO D Data Register (GPIO96 to 127)
#define GPIO_O_GPDSET      0x40U   // GPIO D Data Set Register (GPIO96 to 127)
#define GPIO_O_GPDCLEAR    0x44U   // GPIO D Data Clear Register (GPIO96 to 127)
#define GPIO_O_GPDTOGGLE   0x48U   // GPIO D Data Toggle Register (GPIO96 to 127)
#define GPIO_O_GPDDIR      0x4CU   // GPIO D Direction Register (GPIO0 to 31)
#define GPIO_O_GPFDAT      0x64U   // GPIO F Data Register (GPIO160 to 191)
#define GPIO_O_GPGDAT      0x78U   // GPIO G Data Register (GPIO192 to 223)
#define GPIO_O_GPGSET      0x7CU   // GPIO G Data Set Register (GPIO192 to 223)
#define GPIO_O_GPGCLEAR    0x80U   // GPIO G Data Clear Register (GPIO192 to 223)
#define GPIO_O_GPGTOGGLE   0x84U   // GPIO G Data Toggle Register (GPIO192 to 223)
#define GPIO_O_GPGDIR      0x88U   // GPIO G Direction Register (GPIO0 to 31)
#define GPIO_O_GPHDAT      0x8CU   // GPIO H Data Register (GPIO224 to 255)
#define GPIO_O_GPHSET      0x90U   // GPIO H Data Set Register (GPIO224 to 255)
#define GPIO_O_GPHCLEAR    0x94U   // GPIO H Data Clear Register (GPIO224 to 255)
#define GPIO_O_GPHTOGGLE   0x98U   // GPIO H Data Toggle Register (GPIO224 to 255)
#define GPIO_O_GPHDIR      0x9CU   // GPIO H Direction Register (GPIO0 to 31)

#define GPIO_O_GPADAT_R   0x0U    // GPIO A Data Read Register
#define GPIO_O_GPBDAT_R   0x4U    // GPIO B Data Read Register
#define GPIO_O_GPCDAT_R   0x8U    // GPIO C Data Read Register
#define GPIO_O_GPDDAT_R   0xCU    // GPIO D Data Read Register
#define GPIO_O_GPFDAT_R   0x14U   // GPIO F Data Read Register
#define GPIO_O_GPGDAT_R   0x18U   // GPIO G Data Read Register
#define GPIO_O_GPHDAT_R   0x1CU   // GPIO H Data Read Register


//*************************************************************************************************
//
// The following are defines for the bit fields in the GPACTRL register
//
//*************************************************************************************************
#define GPIO_GPACTRL_QUALPRD0_S   0U
#define GPIO_GPACTRL_QUALPRD0_M   0xFFU         // Qualification sampling period for GPIO0 to GPIO7
#define GPIO_GPACTRL_QUALPRD1_S   8U
#define GPIO_GPACTRL_QUALPRD1_M   0xFF00U       // Qualification sampling period for GPIO8 to
                                                // GPIO15
#define GPIO_GPACTRL_QUALPRD2_S   16U
#define GPIO_GPACTRL_QUALPRD2_M   0xFF0000U     // Qualification sampling period for GPIO16 to
                                                // GPIO23
#define GPIO_GPACTRL_QUALPRD3_S   24U
#define GPIO_GPACTRL_QUALPRD3_M   0xFF000000U   // Qualification sampling period for GPIO24 to
                                                // GPIO31

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAQSEL1 register
//
//*************************************************************************************************
#define GPIO_GPAQSEL1_GPIO0_S    0U
#define GPIO_GPAQSEL1_GPIO0_M    0x3U          // Select input qualification type for GPIO0
#define GPIO_GPAQSEL1_GPIO1_S    2U
#define GPIO_GPAQSEL1_GPIO1_M    0xCU          // Select input qualification type for GPIO1
#define GPIO_GPAQSEL1_GPIO2_S    4U
#define GPIO_GPAQSEL1_GPIO2_M    0x30U         // Select input qualification type for GPIO2
#define GPIO_GPAQSEL1_GPIO3_S    6U
#define GPIO_GPAQSEL1_GPIO3_M    0xC0U         // Select input qualification type for GPIO3
#define GPIO_GPAQSEL1_GPIO4_S    8U
#define GPIO_GPAQSEL1_GPIO4_M    0x300U        // Select input qualification type for GPIO4
#define GPIO_GPAQSEL1_GPIO5_S    10U
#define GPIO_GPAQSEL1_GPIO5_M    0xC00U        // Select input qualification type for GPIO5
#define GPIO_GPAQSEL1_GPIO6_S    12U
#define GPIO_GPAQSEL1_GPIO6_M    0x3000U       // Select input qualification type for GPIO6
#define GPIO_GPAQSEL1_GPIO7_S    14U
#define GPIO_GPAQSEL1_GPIO7_M    0xC000U       // Select input qualification type for GPIO7
#define GPIO_GPAQSEL1_GPIO8_S    16U
#define GPIO_GPAQSEL1_GPIO8_M    0x30000U      // Select input qualification type for GPIO8
#define GPIO_GPAQSEL1_GPIO9_S    18U
#define GPIO_GPAQSEL1_GPIO9_M    0xC0000U      // Select input qualification type for GPIO9
#define GPIO_GPAQSEL1_GPIO10_S   20U
#define GPIO_GPAQSEL1_GPIO10_M   0x300000U     // Select input qualification type for GPIO10
#define GPIO_GPAQSEL1_GPIO11_S   22U
#define GPIO_GPAQSEL1_GPIO11_M   0xC00000U     // Select input qualification type for GPIO11
#define GPIO_GPAQSEL1_GPIO12_S   24U
#define GPIO_GPAQSEL1_GPIO12_M   0x3000000U    // Select input qualification type for GPIO12
#define GPIO_GPAQSEL1_GPIO13_S   26U
#define GPIO_GPAQSEL1_GPIO13_M   0xC000000U    // Select input qualification type for GPIO13
#define GPIO_GPAQSEL1_GPIO14_S   28U
#define GPIO_GPAQSEL1_GPIO14_M   0x30000000U   // Select input qualification type for GPIO14
#define GPIO_GPAQSEL1_GPIO15_S   30U
#define GPIO_GPAQSEL1_GPIO15_M   0xC0000000U   // Select input qualification type for GPIO15

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPAQSEL2_GPIO16_S   0U
#define GPIO_GPAQSEL2_GPIO16_M   0x3U          // Select input qualification type for GPIO16
#define GPIO_GPAQSEL2_GPIO17_S   2U
#define GPIO_GPAQSEL2_GPIO17_M   0xCU          // Select input qualification type for GPIO17
#define GPIO_GPAQSEL2_GPIO18_S   4U
#define GPIO_GPAQSEL2_GPIO18_M   0x30U         // Select input qualification type for GPIO18
#define GPIO_GPAQSEL2_GPIO19_S   6U
#define GPIO_GPAQSEL2_GPIO19_M   0xC0U         // Select input qualification type for GPIO19
#define GPIO_GPAQSEL2_GPIO20_S   8U
#define GPIO_GPAQSEL2_GPIO20_M   0x300U        // Select input qualification type for GPIO20
#define GPIO_GPAQSEL2_GPIO21_S   10U
#define GPIO_GPAQSEL2_GPIO21_M   0xC00U        // Select input qualification type for GPIO21
#define GPIO_GPAQSEL2_GPIO22_S   12U
#define GPIO_GPAQSEL2_GPIO22_M   0x3000U       // Select input qualification type for GPIO22
#define GPIO_GPAQSEL2_GPIO23_S   14U
#define GPIO_GPAQSEL2_GPIO23_M   0xC000U       // Select input qualification type for GPIO23
#define GPIO_GPAQSEL2_GPIO24_S   16U
#define GPIO_GPAQSEL2_GPIO24_M   0x30000U      // Select input qualification type for GPIO24
#define GPIO_GPAQSEL2_GPIO25_S   18U
#define GPIO_GPAQSEL2_GPIO25_M   0xC0000U      // Select input qualification type for GPIO25
#define GPIO_GPAQSEL2_GPIO26_S   20U
#define GPIO_GPAQSEL2_GPIO26_M   0x300000U     // Select input qualification type for GPIO26
#define GPIO_GPAQSEL2_GPIO27_S   22U
#define GPIO_GPAQSEL2_GPIO27_M   0xC00000U     // Select input qualification type for GPIO27
#define GPIO_GPAQSEL2_GPIO28_S   24U
#define GPIO_GPAQSEL2_GPIO28_M   0x3000000U    // Select input qualification type for GPIO28
#define GPIO_GPAQSEL2_GPIO29_S   26U
#define GPIO_GPAQSEL2_GPIO29_M   0xC000000U    // Select input qualification type for GPIO29
#define GPIO_GPAQSEL2_GPIO30_S   28U
#define GPIO_GPAQSEL2_GPIO30_M   0x30000000U   // Select input qualification type for GPIO30
#define GPIO_GPAQSEL2_GPIO31_S   30U
#define GPIO_GPAQSEL2_GPIO31_M   0xC0000000U   // Select input qualification type for GPIO31

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAMUX1 register
//
//*************************************************************************************************
#define GPIO_GPAMUX1_GPIO0_S    0U
#define GPIO_GPAMUX1_GPIO0_M    0x3U          // Defines pin-muxing selection for GPIO0
#define GPIO_GPAMUX1_GPIO1_S    2U
#define GPIO_GPAMUX1_GPIO1_M    0xCU          // Defines pin-muxing selection for GPIO1
#define GPIO_GPAMUX1_GPIO2_S    4U
#define GPIO_GPAMUX1_GPIO2_M    0x30U         // Defines pin-muxing selection for GPIO2
#define GPIO_GPAMUX1_GPIO3_S    6U
#define GPIO_GPAMUX1_GPIO3_M    0xC0U         // Defines pin-muxing selection for GPIO3
#define GPIO_GPAMUX1_GPIO4_S    8U
#define GPIO_GPAMUX1_GPIO4_M    0x300U        // Defines pin-muxing selection for GPIO4
#define GPIO_GPAMUX1_GPIO5_S    10U
#define GPIO_GPAMUX1_GPIO5_M    0xC00U        // Defines pin-muxing selection for GPIO5
#define GPIO_GPAMUX1_GPIO6_S    12U
#define GPIO_GPAMUX1_GPIO6_M    0x3000U       // Defines pin-muxing selection for GPIO6
#define GPIO_GPAMUX1_GPIO7_S    14U
#define GPIO_GPAMUX1_GPIO7_M    0xC000U       // Defines pin-muxing selection for GPIO7
#define GPIO_GPAMUX1_GPIO8_S    16U
#define GPIO_GPAMUX1_GPIO8_M    0x30000U      // Defines pin-muxing selection for GPIO8
#define GPIO_GPAMUX1_GPIO9_S    18U
#define GPIO_GPAMUX1_GPIO9_M    0xC0000U      // Defines pin-muxing selection for GPIO9
#define GPIO_GPAMUX1_GPIO10_S   20U
#define GPIO_GPAMUX1_GPIO10_M   0x300000U     // Defines pin-muxing selection for GPIO10
#define GPIO_GPAMUX1_GPIO11_S   22U
#define GPIO_GPAMUX1_GPIO11_M   0xC00000U     // Defines pin-muxing selection for GPIO11
#define GPIO_GPAMUX1_GPIO12_S   24U
#define GPIO_GPAMUX1_GPIO12_M   0x3000000U    // Defines pin-muxing selection for GPIO12
#define GPIO_GPAMUX1_GPIO13_S   26U
#define GPIO_GPAMUX1_GPIO13_M   0xC000000U    // Defines pin-muxing selection for GPIO13
#define GPIO_GPAMUX1_GPIO14_S   28U
#define GPIO_GPAMUX1_GPIO14_M   0x30000000U   // Defines pin-muxing selection for GPIO14
#define GPIO_GPAMUX1_GPIO15_S   30U
#define GPIO_GPAMUX1_GPIO15_M   0xC0000000U   // Defines pin-muxing selection for GPIO15

