TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFMUX1 register
//
//*************************************************************************************************
#define GPIO_GPFMUX1_GPIO160_S   0U
#define GPIO_GPFMUX1_GPIO160_M   0x3U          // Defines pin-muxing selection for GPIO160
#define GPIO_GPFMUX1_GPIO161_S   2U
#define GPIO_GPFMUX1_GPIO161_M   0xCU          // Defines pin-muxing selection for GPIO161
#define GPIO_GPFMUX1_GPIO162_S   4U
#define GPIO_GPFMUX1_GPIO162_M   0x30U         // Defines pin-muxing selection for GPIO162
#define GPIO_GPFMUX1_GPIO163_S   6U
#define GPIO_GPFMUX1_GPIO163_M   0xC0U         // Defines pin-muxing selection for GPIO163
#define GPIO_GPFMUX1_GPIO164_S   8U
#define GPIO_GPFMUX1_GPIO164_M   0x300U        // Defines pin-muxing selection for GPIO164
#define GPIO_GPFMUX1_GPIO165_S   10U
#define GPIO_GPFMUX1_GPIO165_M   0xC00U        // Defines pin-muxing selection for GPIO165
#define GPIO_GPFMUX1_GPIO166_S   12U
#define GPIO_GPFMUX1_GPIO166_M   0x3000U       // Defines pin-muxing selection for GPIO166
#define GPIO_GPFMUX1_GPIO167_S   14U
#define GPIO_GPFMUX1_GPIO167_M   0xC000U       // Defines pin-muxing selection for GPIO167
#define GPIO_GPFMUX1_GPIO168_S   16U
#define GPIO_GPFMUX1_GPIO168_M   0x30000U      // Defines pin-muxing selection for GPIO168
#define GPIO_GPFMUX1_GPIO169_S   18U
#define GPIO_GPFMUX1_GPIO169_M   0xC0000U      // Defines pin-muxing selection for GPIO169
#define GPIO_GPFMUX1_GPIO170_S   20U
#define GPIO_GPFMUX1_GPIO170_M   0x300000U     // Defines pin-muxing selection for GPIO170
#define GPIO_GPFMUX1_GPIO171_S   22U
#define GPIO_GPFMUX1_GPIO171_M   0xC00000U     // Defines pin-muxing selection for GPIO171
#define GPIO_GPFMUX1_GPIO172_S   24U
#define GPIO_GPFMUX1_GPIO172_M   0x3000000U    // Defines pin-muxing selection for GPIO172
#define GPIO_GPFMUX1_GPIO173_S   26U
#define GPIO_GPFMUX1_GPIO173_M   0xC000000U    // Defines pin-muxing selection for GPIO173
#define GPIO_GPFMUX1_GPIO174_S   28U
#define GPIO_GPFMUX1_GPIO174_M   0x30000000U   // Defines pin-muxing selection for GPIO174
#define GPIO_GPFMUX1_GPIO175_S   30U
#define GPIO_GPFMUX1_GPIO175_M   0xC0000000U   // Defines pin-muxing selection for GPIO175

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFMUX2 register
//
//*************************************************************************************************
#define GPIO_GPFMUX2_GPIO176_S   0U
#define GPIO_GPFMUX2_GPIO176_M   0x3U          // Defines pin-muxing selection for GPIO176
#define GPIO_GPFMUX2_GPIO177_S   2U
#define GPIO_GPFMUX2_GPIO177_M   0xCU          // Defines pin-muxing selection for GPIO177
#define GPIO_GPFMUX2_GPIO178_S   4U
#define GPIO_GPFMUX2_GPIO178_M   0x30U         // Defines pin-muxing selection for GPIO178
#define GPIO_GPFMUX2_GPIO179_S   6U
#define GPIO_GPFMUX2_GPIO179_M   0xC0U         // Defines pin-muxing selection for GPIO179
#define GPIO_GPFMUX2_GPIO180_S   8U
#define GPIO_GPFMUX2_GPIO180_M   0x300U        // Defines pin-muxing selection for GPIO180
#define GPIO_GPFMUX2_GPIO181_S   10U
#define GPIO_GPFMUX2_GPIO181_M   0xC00U        // Defines pin-muxing selection for GPIO181
#define GPIO_GPFMUX2_GPIO182_S   12U
#define GPIO_GPFMUX2_GPIO182_M   0x3000U       // Defines pin-muxing selection for GPIO182
#define GPIO_GPFMUX2_GPIO183_S   14U
#define GPIO_GPFMUX2_GPIO183_M   0xC000U       // Defines pin-muxing selection for GPIO183
#define GPIO_GPFMUX2_GPIO184_S   16U
#define GPIO_GPFMUX2_GPIO184_M   0x30000U      // Defines pin-muxing selection for GPIO184
#define GPIO_GPFMUX2_GPIO185_S   18U
#define GPIO_GPFMUX2_GPIO185_M   0xC0000U      // Defines pin-muxing selection for GPIO185
#define GPIO_GPFMUX2_GPIO186_S   20U
#define GPIO_GPFMUX2_GPIO186_M   0x300000U     // Defines pin-muxing selection for GPIO186
#define GPIO_GPFMUX2_GPIO187_S   22U
#define GPIO_GPFMUX2_GPIO187_M   0xC00000U     // Defines pin-muxing selection for GPIO187
#define GPIO_GPFMUX2_GPIO188_S   24U
#define GPIO_GPFMUX2_GPIO188_M   0x3000000U    // Defines pin-muxing selection for GPIO188
#define GPIO_GPFMUX2_GPIO189_S   26U
#define GPIO_GPFMUX2_GPIO189_M   0xC000000U    // Defines pin-muxing selection for GPIO189
#define GPIO_GPFMUX2_GPIO190_S   28U
#define GPIO_GPFMUX2_GPIO190_M   0x30000000U   // Defines pin-muxing selection for GPIO190
#define GPIO_GPFMUX2_GPIO191_S   30U
#define GPIO_GPFMUX2_GPIO191_M   0xC0000000U   // Defines pin-muxing selection for GPIO191

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFPUD register
//
//*************************************************************************************************
#define GPIO_GPFPUD_GPIO160   0x1U          // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO161   0x2U          // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO162   0x4U          // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO163   0x8U          // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO164   0x10U         // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO165   0x20U         // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO166   0x40U         // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO167   0x80U         // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO168   0x100U        // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO169   0x200U        // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO170   0x400U        // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO171   0x800U        // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO172   0x1000U       // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO173   0x2000U       // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO174   0x4000U       // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO175   0x8000U       // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO176   0x10000U      // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO177   0x20000U      // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO178   0x40000U      // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO179   0x80000U      // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO180   0x100000U     // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO181   0x200000U     // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO182   0x400000U     // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO183   0x800000U     // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO184   0x1000000U    // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO185   0x2000000U    // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO186   0x4000000U    // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO187   0x8000000U    // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO188   0x10000000U   // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO189   0x20000000U   // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO190   0x40000000U   // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO191   0x80000000U   // Pull-Up Disable control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFINV register
//
//*************************************************************************************************
#define GPIO_GPFINV_GPIO160   0x1U          // Input inversion control for this pin
#define GPIO_GPFINV_GPIO161   0x2U          // Input inversion control for this pin
#define GPIO_GPFINV_GPIO162   0x4U          // Input inversion control for this pin
#define GPIO_GPFINV_GPIO163   0x8U          // Input inversion control for this pin
#define GPIO_GPFINV_GPIO164   0x10U         // Input inversion control for this pin
#define GPIO_GPFINV_GPIO165   0x20U         // Input inversion control for this pin
#define GPIO_GPFINV_GPIO166   0x40U         // Input inversion control for this pin
#define GPIO_GPFINV_GPIO167   0x80U         // Input inversion control for this pin
#define GPIO_GPFINV_GPIO168   0x100U        // Input inversion control for this pin
#define GPIO_GPFINV_GPIO169   0x200U        // Input inversion control for this pin
#define GPIO_GPFINV_GPIO170   0x400U        // Input inversion control for this pin
#define GPIO_GPFINV_GPIO171   0x800U        // Input inversion control for this pin
#define GPIO_GPFINV_GPIO172   0x1000U       // Input inversion control for this pin
#define GPIO_GPFINV_GPIO173   0x2000U       // Input inversion control for this pin
#define GPIO_GPFINV_GPIO174   0x4000U       // Input inversion control for this pin
#define GPIO_GPFINV_GPIO175   0x8000U       // Input inversion control for this pin
#define GPIO_GPFINV_GPIO176   0x10000U      // Input inversion control for this pin
#define GPIO_GPFINV_GPIO177   0x20000U      // Input inversion control for this pin
#define GPIO_GPFINV_GPIO178   0x40000U      // Input inversion control for this pin
#define GPIO_GPFINV_GPIO179   0x80000U      // Input inversion control for this pin
#define GPIO_GPFINV_GPIO180   0x100000U     // Input inversion control for this pin
#define GPIO_GPFINV_GPIO181   0x200000U     // Input inversion control for this pin
#define GPIO_GPFINV_GPIO182   0x400000U     // Input inversion control for this pin
#define GPIO_GPFINV_GPIO183   0x800000U     // Input inversion control for this pin
#define GPIO_GPFINV_GPIO184   0x1000000U    // Input inversion control for this pin
#define GPIO_GPFINV_GPIO185   0x2000000U    // Input inversion control for this pin
#define GPIO_GPFINV_GPIO186   0x4000000U    // Input inversion control for this pin
#define GPIO_GPFINV_GPIO187   0x8000000U    // Input inversion control for this pin
#define GPIO_GPFINV_GPIO188   0x10000000U   // Input inversion control for this pin
#define GPIO_GPFINV_GPIO189   0x20000000U   // Input inversion control for this pin
#define GPIO_GPFINV_GPIO190   0x40000000U   // Input inversion control for this pin
#define GPIO_GPFINV_GPIO191   0x80000000U   // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFAMSEL register
//
//*************************************************************************************************
#define GPIO_GPFAMSEL_GPIO160   0x1U          // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO161   0x2U          // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO162   0x4U          // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO163   0x8U          // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO164   0x10U         // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO165   0x20U         // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO166   0x40U         // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO167   0x80U         // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO168   0x100U        // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO169   0x200U        // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO170   0x400U        // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO171   0x800U        // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO172   0x1000U       // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO173   0x2000U       // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO174   0x4000U       // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO175   0x8000U       // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO176   0x10000U      // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO177   0x20000U      // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO178   0x40000U      // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO179   0x80000U      // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO180   0x100000U     // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO181   0x200000U     // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO182   0x400000U     // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO183   0x800000U     // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO184   0x1000000U    // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO185   0x2000000U    // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO186   0x4000000U    // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO187   0x8000000U    // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO188   0x10000000U   // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO189   0x20000000U   // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO190   0x40000000U   // Analog Mode select for this pin
#define GPIO_GPFAMSEL_GPIO191   0x80000000U   // Analog Mode select for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPFGMUX1_GPIO160_S   0U
#define GPIO_GPFGMUX1_GPIO160_M   0x3U          // Defines pin-muxing selection for GPIO160
#define GPIO_GPFGMUX1_GPIO161_S   2U
#define GPIO_GPFGMUX1_GPIO161_M   0xCU          // Defines pin-muxing selection for GPIO161
#define GPIO_GPFGMUX1_GPIO162_S   4U
#define GPIO_GPFGMUX1_GPIO162_M   0x30U         // Defines pin-muxing selection for GPIO162
#define GPIO_GPFGMUX1_GPIO163_S   6U
#define GPIO_GPFGMUX1_GPIO163_M   0xC0U         // Defines pin-muxing selection for GPIO163
#define GPIO_GPFGMUX1_GPIO164_S   8U
#define GPIO_GPFGMUX1_GPIO164_M   0x300U        // Defines pin-muxing selection for GPIO164
#define GPIO_GPFGMUX1_GPIO165_S   10U
#define GPIO_GPFGMUX1_GPIO165_M   0xC00U        // Defines pin-muxing selection for GPIO165
#define GPIO_GPFGMUX1_GPIO166_S   12U
#define GPIO_GPFGMUX1_GPIO166_M   0x3000U       // Defines pin-muxing selection for GPIO166
#define GPIO_GPFGMUX1_GPIO167_S   14U
#define GPIO_GPFGMUX1_GPIO167_M   0xC000U       // Defines pin-muxing selection for GPIO167
#define GPIO_GPFGMUX1_GPIO168_S   16U
#define GPIO_GPFGMUX1_GPIO168_M   0x30000U      // Defines pin-muxing selection for GPIO168
#define GPIO_GPFGMUX1_GPIO169_S   18U
#define GPIO_GPFGMUX1_GPIO169_M   0xC0000U      // Defines pin-muxing selection for GPIO169
#define GPIO_GPFGMUX1_GPIO170_S   20U
#define GPIO_GPFGMUX1_GPIO170_M   0x300000U     // Defines pin-muxing selection for GPIO170
#define GPIO_GPFGMUX1_GPIO171_S   22U
#define GPIO_GPFGMUX1_GPIO171_M   0xC00000U     // Defines pin-muxing selection for GPIO171
#define GPIO_GPFGMUX1_GPIO172_S   24U
#define GPIO_GPFGMUX1_GPIO172_M   0x3000000U    // Defines pin-muxing selection for GPIO172
#define GPIO_GPFGMUX1_GPIO173_S   26U
#define GPIO_GPFGMUX1_GPIO173_M   0xC000000U    // Defines pin-muxing selection for GPIO173
#define GPIO_GPFGMUX1_GPIO174_S   28U
#define GPIO_GPFGMUX1_GPIO174_M   0x30000000U   // Defines pin-muxing selection for GPIO174
#define GPIO_GPFGMUX1_GPIO175_S   30U
#define GPIO_GPFGMUX1_GPIO175_M   0xC0000000U   // Defines pin-muxing selection for GPIO175

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPFGMUX2_GPIO176_S   0U
#define GPIO_GPFGMUX2_GPIO176_M   0x3U          // Defines pin-muxing selection for GPIO176
#define GPIO_GPFGMUX2_GPIO177_S   2U
#define GPIO_GPFGMUX2_GPIO177_M   0xCU          // Defines pin-muxing selection for GPIO177
#define GPIO_GPFGMUX2_GPIO178_S   4U
#define GPIO_GPFGMUX2_GPIO178_M   0x30U         // Defines pin-muxing selection for GPIO178
#define GPIO_GPFGMUX2_GPIO179_S   6U
#define GPIO_GPFGMUX2_GPIO179_M   0xC0U         // Defines pin-muxing selection for GPIO179
#define GPIO_GPFGMUX2_GPIO180_S   8U
#define GPIO_GPFGMUX2_GPIO180_M   0x300U        // Defines pin-muxing selection for GPIO180
#define GPIO_GPFGMUX2_GPIO181_S   10U
#define GPIO_GPFGMUX2_GPIO181_M   0xC00U        // Defines pin-muxing selection for GPIO181
#define GPIO_GPFGMUX2_GPIO182_S   12U
#define GPIO_GPFGMUX2_GPIO182_M   0x3000U       // Defines pin-muxing selection for GPIO182
#define GPIO_GPFGMUX2_GPIO183_S   14U
#define GPIO_GPFGMUX2_GPIO183_M   0xC000U       // Defines pin-muxing selection for GPIO183
#define GPIO_GPFGMUX2_GPIO184_S   16U
#define GPIO_GPFGMUX2_GPIO184_M   0x30000U      // Defines pin-muxing selection for GPIO184
#define GPIO_GPFGMUX2_GPIO185_S   18U
#define GPIO_GPFGMUX2_GPIO185_M   0xC0000U      // Defines pin-muxing selection for GPIO185
#define GPIO_GPFGMUX2_GPIO186_S   20U
#define GPIO_GPFGMUX2_GPIO186_M   0x300000U     // Defines pin-muxing selection for GPIO186
#define GPIO_GPFGMUX2_GPIO187_S   22U
#define GPIO_GPFGMUX2_GPIO187_M   0xC00000U     // Defines pin-muxing selection for GPIO187
#define GPIO_GPFGMUX2_GPIO188_S   24U
#define GPIO_GPFGMUX2_GPIO188_M   0x3000000U    // Defines pin-muxing selection for GPIO188
#define GPIO_GPFGMUX2_GPIO189_S   26U
#define GPIO_GPFGMUX2_GPIO189_M   0xC000000U    // Defines pin-muxing selection for GPIO189
#define GPIO_GPFGMUX2_GPIO190_S   28U
#define GPIO_GPFGMUX2_GPIO190_M   0x30000000U   // Defines pin-muxing selection for GPIO190
#define GPIO_GPFGMUX2_GPIO191_S   30U
#define GPIO_GPFGMUX2_GPIO191_M   0xC0000000U   // Defines pin-muxing selection for GPIO191

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL1 register
//
//*************************************************************************************************
#define GPIO_GPFCSEL1_GPIO160_S   0U
#define GPIO_GPFCSEL1_GPIO160_M   0xFU          // GPIO160 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO161_S   4U
#define GPIO_GPFCSEL1_GPIO161_M   0xF0U         // GPIO161 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO162_S   8U
#define GPIO_GPFCSEL1_GPIO162_M   0xF00U        // GPIO162 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO163_S   12U
#define GPIO_GPFCSEL1_GPIO163_M   0xF000U       // GPIO163 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO164_S   16U
#define GPIO_GPFCSEL1_GPIO164_M   0xF0000U      // GPIO164 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO165_S   20U
#define GPIO_GPFCSEL1_GPIO165_M   0xF00000U     // GPIO165 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO166_S   24U
#define GPIO_GPFCSEL1_GPIO166_M   0xF000000U    // GPIO166 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO167_S   28U
#define GPIO_GPFCSEL1_GPIO167_M   0xF0000000U   // GPIO167 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL2 register
//
//*************************************************************************************************
#define GPIO_GPFCSEL2_GPIO168_S   0U
#define GPIO_GPFCSEL2_GPIO168_M   0xFU          // GPIO168 Controller CPU Select
#define GPIO_GPFCSEL2_GPIO169_S   4U
#define GPIO_GPFCSEL2_GPIO169_M   0xF0U         // GPIO169 Controller CPU Select
#define GPIO_GPFCSEL2_GPIO170_S   8U
#define GPIO_GPFCSEL2_GPIO170_M   0xF00U        // GPIO170 Controller CPU Select
#define GPIO_GPFCSEL2_GPIO171_S   12U
#define GPIO_GPFCSEL2_GPIO171_M   0xF000U       // GPIO171 Controller CPU Select
#define GPIO_GPFCSEL2_GPIO172_S   16U
#define GPIO_GPFCSEL2_GPIO172_M   0xF0000U      // GPIO172 Controller CPU Select
#define GPIO_GPFCSEL2_GPIO173_S   20U
#define GPIO_GPFCSEL2_GPIO173_M   0xF00000U     // GPIO173 Controller CPU Select
#define GPIO_GPFCSEL2_GPIO174_S   24U
#define GPIO_GPFCSEL2_GPIO174_M   0xF000000U    // GPIO174 Controller CPU Select
#define GPIO_GPFCSEL2_GPIO175_S   28U
#define GPIO_GPFCSEL2_GPIO175_M   0xF0000000U   // GPIO175 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL3 register
//
//*************************************************************************************************
#define GPIO_GPFCSEL3_GPIO176_S   0U
#define GPIO_GPFCSEL3_GPIO176_M   0xFU          // GPIO176 Controller CPU Select
#define GPIO_GPFCSEL3_GPIO177_S   4U
#define GPIO_GPFCSEL3_GPIO177_M   0xF0U         // GPIO177 Controller CPU Select
#define GPIO_GPFCSEL3_GPIO178_S   8U
#define GPIO_GPFCSEL3_GPIO178_M   0xF00U        // GPIO178 Controller CPU Select
#define GPIO_GPFCSEL3_GPIO179_S   12U
#define GPIO_GPFCSEL3_GPIO179_M   0xF000U       // GPIO179 Controller CPU Select
#define GPIO_GPFCSEL3_GPIO180_S   16U
#define GPIO_GPFCSEL3_GPIO180_M   0xF0000U      // GPIO180 Controller CPU Select
#define GPIO_GPFCSEL3_GPIO181_S   20U
#define GPIO_GPFCSEL3_GPIO181_M   0xF00000U     // GPIO181 Controller CPU Select
#define GPIO_GPFCSEL3_GPIO182_S   24U
#define GPIO_GPFCSEL3_GPIO182_M   0xF000000U    // GPIO182 Controller CPU Select
#define GPIO_GPFCSEL3_GPIO183_S   28U
#define GPIO_GPFCSEL3_GPIO183_M   0xF0000000U   // GPIO183 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL4 register
//
//*************************************************************************************************
#define GPIO_GPFCSEL4_GPIO184_S   0U
#define GPIO_GPFCSEL4_GPIO184_M   0xFU          // GPIO184 Controller CPU Select
#define GPIO_GPFCSEL4_GPIO185_S   4U
#define GPIO_GPFCSEL4_GPIO185_M   0xF0U         // GPIO185 Controller CPU Select
#define GPIO_GPFCSEL4_GPIO186_S   8U
#define GPIO_GPFCSEL4_GPIO186_M   0xF00U        // GPIO186 Controller CPU Select
#define GPIO_GPFCSEL4_GPIO187_S   12U
#define GPIO_GPFCSEL4_GPIO187_M   0xF000U       // GPIO187 Controller CPU Select
#define GPIO_GPFCSEL4_GPIO188_S   16U
#define GPIO_GPFCSEL4_GPIO188_M   0xF0000U      // GPIO188 Controller CPU Select
#define GPIO_GPFCSEL4_GPIO189_S   20U
#define GPIO_GPFCSEL4_GPIO189_M   0xF00000U     // GPIO189 Controller CPU Select
#define GPIO_GPFCSEL4_GPIO190_S   24U
#define GPIO_GPFCSEL4_GPIO190_M   0xF000000U    // GPIO190 Controller CPU Select
#define GPIO_GPFCSEL4_GPIO191_S   28U
#define GPIO_GPFCSEL4_GPIO191_M   0xF0000000U   // GPIO191 Controller CPU Select

