TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFLOCK register
//
//*************************************************************************************************
#define GPIO_GPFLOCK_GPIO160   0x1U          // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO161   0x2U          // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO162   0x4U          // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO163   0x8U          // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO164   0x10U         // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO165   0x20U         // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO166   0x40U         // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO167   0x80U         // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO168   0x100U        // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO169   0x200U        // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO170   0x400U        // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO171   0x800U        // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO172   0x1000U       // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO173   0x2000U       // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO174   0x4000U       // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO175   0x8000U       // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO176   0x10000U      // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO177   0x20000U      // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO178   0x40000U      // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO179   0x80000U      // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO180   0x100000U     // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO181   0x200000U     // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO182   0x400000U     // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO183   0x800000U     // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO184   0x1000000U    // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO185   0x2000000U    // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO186   0x4000000U    // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO187   0x8000000U    // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO188   0x10000000U   // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO189   0x20000000U   // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO190   0x40000000U   // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO191   0x80000000U   // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFCR register
//
//*************************************************************************************************
#define GPIO_GPFCR_GPIO160   0x1U          // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO161   0x2U          // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO162   0x4U          // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO163   0x8U          // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO164   0x10U         // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO165   0x20U         // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO166   0x40U         // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO167   0x80U         // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO168   0x100U        // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO169   0x200U        // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO170   0x400U        // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO171   0x800U        // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO172   0x1000U       // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO173   0x2000U       // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO174   0x4000U       // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO175   0x8000U       // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO176   0x10000U      // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO177   0x20000U      // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO178   0x40000U      // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO179   0x80000U      // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO180   0x100000U     // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO181   0x200000U     // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO182   0x400000U     // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO183   0x800000U     // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO184   0x1000000U    // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO185   0x2000000U    // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO186   0x4000000U    // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO187   0x8000000U    // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO188   0x10000000U   // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO189   0x20000000U   // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO190   0x40000000U   // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO191   0x80000000U   // Configuration lock commit bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCTRL register
//
//*************************************************************************************************
#define GPIO_GPGCTRL_QUALPRD0_S   0U
#define GPIO_GPGCTRL_QUALPRD0_M   0xFFU         // Qualification sampling period for GPIO192 to
                                                // GPIO199
#define GPIO_GPGCTRL_QUALPRD1_S   8U
#define GPIO_GPGCTRL_QUALPRD1_M   0xFF00U       // Qualification sampling period for GPIO200 to
                                                // GPIO207
#define GPIO_GPGCTRL_QUALPRD2_S   16U
#define GPIO_GPGCTRL_QUALPRD2_M   0xFF0000U     // Qualification sampling period for GPIO208 to
                                                // GPIO215
#define GPIO_GPGCTRL_QUALPRD3_S   24U
#define GPIO_GPGCTRL_QUALPRD3_M   0xFF000000U   // Qualification sampling period for GPIO216 to
                                                // GPIO223

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGQSEL1 register
//
//*************************************************************************************************
#define GPIO_GPGQSEL1_GPIO192_S   0U
#define GPIO_GPGQSEL1_GPIO192_M   0x3U          // Select input qualification type for GPIO192
#define GPIO_GPGQSEL1_GPIO193_S   2U
#define GPIO_GPGQSEL1_GPIO193_M   0xCU          // Select input qualification type for GPIO193
#define GPIO_GPGQSEL1_GPIO194_S   4U
#define GPIO_GPGQSEL1_GPIO194_M   0x30U         // Select input qualification type for GPIO194
#define GPIO_GPGQSEL1_GPIO195_S   6U
#define GPIO_GPGQSEL1_GPIO195_M   0xC0U         // Select input qualification type for GPIO195
#define GPIO_GPGQSEL1_GPIO196_S   8U
#define GPIO_GPGQSEL1_GPIO196_M   0x300U        // Select input qualification type for GPIO196
#define GPIO_GPGQSEL1_GPIO197_S   10U
#define GPIO_GPGQSEL1_GPIO197_M   0xC00U        // Select input qualification type for GPIO197
#define GPIO_GPGQSEL1_GPIO198_S   12U
#define GPIO_GPGQSEL1_GPIO198_M   0x3000U       // Select input qualification type for GPIO198
#define GPIO_GPGQSEL1_GPIO199_S   14U
#define GPIO_GPGQSEL1_GPIO199_M   0xC000U       // Select input qualification type for GPIO199
#define GPIO_GPGQSEL1_GPIO200_S   16U
#define GPIO_GPGQSEL1_GPIO200_M   0x30000U      // Select input qualification type for GPIO200
#define GPIO_GPGQSEL1_GPIO201_S   18U
#define GPIO_GPGQSEL1_GPIO201_M   0xC0000U      // Select input qualification type for GPIO201
#define GPIO_GPGQSEL1_GPIO202_S   20U
#define GPIO_GPGQSEL1_GPIO202_M   0x300000U     // Select input qualification type for GPIO202
#define GPIO_GPGQSEL1_GPIO203_S   22U
#define GPIO_GPGQSEL1_GPIO203_M   0xC00000U     // Select input qualification type for GPIO203
#define GPIO_GPGQSEL1_GPIO204_S   24U
#define GPIO_GPGQSEL1_GPIO204_M   0x3000000U    // Select input qualification type for GPIO204
#define GPIO_GPGQSEL1_GPIO205_S   26U
#define GPIO_GPGQSEL1_GPIO205_M   0xC000000U    // Select input qualification type for GPIO205
#define GPIO_GPGQSEL1_GPIO206_S   28U
#define GPIO_GPGQSEL1_GPIO206_M   0x30000000U   // Select input qualification type for GPIO206
#define GPIO_GPGQSEL1_GPIO207_S   30U
#define GPIO_GPGQSEL1_GPIO207_M   0xC0000000U   // Select input qualification type for GPIO207

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPGQSEL2_GPIO208_S   0U
#define GPIO_GPGQSEL2_GPIO208_M   0x3U          // Select input qualification type for GPIO208
#define GPIO_GPGQSEL2_GPIO209_S   2U
#define GPIO_GPGQSEL2_GPIO209_M   0xCU          // Select input qualification type for GPIO209
#define GPIO_GPGQSEL2_GPIO210_S   4U
#define GPIO_GPGQSEL2_GPIO210_M   0x30U         // Select input qualification type for GPIO210
#define GPIO_GPGQSEL2_GPIO211_S   6U
#define GPIO_GPGQSEL2_GPIO211_M   0xC0U         // Select input qualification type for GPIO211
#define GPIO_GPGQSEL2_GPIO212_S   8U
#define GPIO_GPGQSEL2_GPIO212_M   0x300U        // Select input qualification type for GPIO212
#define GPIO_GPGQSEL2_GPIO213_S   10U
#define GPIO_GPGQSEL2_GPIO213_M   0xC00U        // Select input qualification type for GPIO213
#define GPIO_GPGQSEL2_GPIO219_S   22U
#define GPIO_GPGQSEL2_GPIO219_M   0xC00000U     // Select input qualification type for GPIO219
#define GPIO_GPGQSEL2_GPIO220_S   24U
#define GPIO_GPGQSEL2_GPIO220_M   0x3000000U    // Select input qualification type for GPIO220
#define GPIO_GPGQSEL2_GPIO221_S   26U
#define GPIO_GPGQSEL2_GPIO221_M   0xC000000U    // Select input qualification type for GPIO221
#define GPIO_GPGQSEL2_GPIO222_S   28U
#define GPIO_GPGQSEL2_GPIO222_M   0x30000000U   // Select input qualification type for GPIO222
#define GPIO_GPGQSEL2_GPIO223_S   30U
#define GPIO_GPGQSEL2_GPIO223_M   0xC0000000U   // Select input qualification type for GPIO223

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPGMUX1_GPIO192_S   0U
#define GPIO_GPGMUX1_GPIO192_M   0x3U          // Defines pin-muxing selection for GPIO192
#define GPIO_GPGMUX1_GPIO193_S   2U
#define GPIO_GPGMUX1_GPIO193_M   0xCU          // Defines pin-muxing selection for GPIO193
#define GPIO_GPGMUX1_GPIO194_S   4U
#define GPIO_GPGMUX1_GPIO194_M   0x30U         // Defines pin-muxing selection for GPIO194
#define GPIO_GPGMUX1_GPIO195_S   6U
#define GPIO_GPGMUX1_GPIO195_M   0xC0U         // Defines pin-muxing selection for GPIO195
#define GPIO_GPGMUX1_GPIO196_S   8U
#define GPIO_GPGMUX1_GPIO196_M   0x300U        // Defines pin-muxing selection for GPIO196
#define GPIO_GPGMUX1_GPIO197_S   10U
#define GPIO_GPGMUX1_GPIO197_M   0xC00U        // Defines pin-muxing selection for GPIO197
#define GPIO_GPGMUX1_GPIO198_S   12U
#define GPIO_GPGMUX1_GPIO198_M   0x3000U       // Defines pin-muxing selection for GPIO198
#define GPIO_GPGMUX1_GPIO199_S   14U
#define GPIO_GPGMUX1_GPIO199_M   0xC000U       // Defines pin-muxing selection for GPIO199
#define GPIO_GPGMUX1_GPIO200_S   16U
#define GPIO_GPGMUX1_GPIO200_M   0x30000U      // Defines pin-muxing selection for GPIO200
#define GPIO_GPGMUX1_GPIO201_S   18U
#define GPIO_GPGMUX1_GPIO201_M   0xC0000U      // Defines pin-muxing selection for GPIO201
#define GPIO_GPGMUX1_GPIO202_S   20U
#define GPIO_GPGMUX1_GPIO202_M   0x300000U     // Defines pin-muxing selection for GPIO202
#define GPIO_GPGMUX1_GPIO203_S   22U
#define GPIO_GPGMUX1_GPIO203_M   0xC00000U     // Defines pin-muxing selection for GPIO203
#define GPIO_GPGMUX1_GPIO204_S   24U
#define GPIO_GPGMUX1_GPIO204_M   0x3000000U    // Defines pin-muxing selection for GPIO204
#define GPIO_GPGMUX1_GPIO205_S   26U
#define GPIO_GPGMUX1_GPIO205_M   0xC000000U    // Defines pin-muxing selection for GPIO205
#define GPIO_GPGMUX1_GPIO206_S   28U
#define GPIO_GPGMUX1_GPIO206_M   0x30000000U   // Defines pin-muxing selection for GPIO206
#define GPIO_GPGMUX1_GPIO207_S   30U
#define GPIO_GPGMUX1_GPIO207_M   0xC0000000U   // Defines pin-muxing selection for GPIO207

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPGMUX2_GPIO208_S   0U
#define GPIO_GPGMUX2_GPIO208_M   0x3U          // Defines pin-muxing selection for GPIO208
#define GPIO_GPGMUX2_GPIO209_S   2U
#define GPIO_GPGMUX2_GPIO209_M   0xCU          // Defines pin-muxing selection for GPIO209
#define GPIO_GPGMUX2_GPIO210_S   4U
#define GPIO_GPGMUX2_GPIO210_M   0x30U         // Defines pin-muxing selection for GPIO210
#define GPIO_GPGMUX2_GPIO211_S   6U
#define GPIO_GPGMUX2_GPIO211_M   0xC0U         // Defines pin-muxing selection for GPIO211
#define GPIO_GPGMUX2_GPIO212_S   8U
#define GPIO_GPGMUX2_GPIO212_M   0x300U        // Defines pin-muxing selection for GPIO212
#define GPIO_GPGMUX2_GPIO213_S   10U
#define GPIO_GPGMUX2_GPIO213_M   0xC00U        // Defines pin-muxing selection for GPIO213
#define GPIO_GPGMUX2_GPIO219_S   22U
#define GPIO_GPGMUX2_GPIO219_M   0xC00000U     // Defines pin-muxing selection for GPIO219
#define GPIO_GPGMUX2_GPIO220_S   24U
#define GPIO_GPGMUX2_GPIO220_M   0x3000000U    // Defines pin-muxing selection for GPIO220
#define GPIO_GPGMUX2_GPIO221_S   26U
#define GPIO_GPGMUX2_GPIO221_M   0xC000000U    // Defines pin-muxing selection for GPIO221
#define GPIO_GPGMUX2_GPIO222_S   28U
#define GPIO_GPGMUX2_GPIO222_M   0x30000000U   // Defines pin-muxing selection for GPIO222
#define GPIO_GPGMUX2_GPIO223_S   30U
#define GPIO_GPGMUX2_GPIO223_M   0xC0000000U   // Defines pin-muxing selection for GPIO223

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGPUD register
//
//*************************************************************************************************
#define GPIO_GPGPUD_GPIO192   0x1U          // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO193   0x2U          // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO194   0x4U          // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO195   0x8U          // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO196   0x10U         // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO197   0x20U         // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO198   0x40U         // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO199   0x80U         // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO200   0x100U        // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO201   0x200U        // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO202   0x400U        // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO203   0x800U        // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO204   0x1000U       // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO205   0x2000U       // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO206   0x4000U       // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO207   0x8000U       // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO208   0x10000U      // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO209   0x20000U      // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO210   0x40000U      // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO211   0x80000U      // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO212   0x100000U     // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO213   0x200000U     // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO219   0x8000000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO220   0x10000000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO221   0x20000000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO222   0x40000000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO223   0x80000000U   // Pull-Up Disable control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGINV register
//
//*************************************************************************************************
#define GPIO_GPGINV_GPIO192   0x1U          // Input inversion control for this pin
#define GPIO_GPGINV_GPIO193   0x2U          // Input inversion control for this pin
#define GPIO_GPGINV_GPIO194   0x4U          // Input inversion control for this pin
#define GPIO_GPGINV_GPIO195   0x8U          // Input inversion control for this pin
#define GPIO_GPGINV_GPIO196   0x10U         // Input inversion control for this pin
#define GPIO_GPGINV_GPIO197   0x20U         // Input inversion control for this pin
#define GPIO_GPGINV_GPIO198   0x40U         // Input inversion control for this pin
#define GPIO_GPGINV_GPIO199   0x80U         // Input inversion control for this pin
#define GPIO_GPGINV_GPIO200   0x100U        // Input inversion control for this pin
#define GPIO_GPGINV_GPIO201   0x200U        // Input inversion control for this pin
#define GPIO_GPGINV_GPIO202   0x400U        // Input inversion control for this pin
#define GPIO_GPGINV_GPIO203   0x800U        // Input inversion control for this pin
#define GPIO_GPGINV_GPIO204   0x1000U       // Input inversion control for this pin
#define GPIO_GPGINV_GPIO205   0x2000U       // Input inversion control for this pin
#define GPIO_GPGINV_GPIO206   0x4000U       // Input inversion control for this pin
#define GPIO_GPGINV_GPIO207   0x8000U       // Input inversion control for this pin
#define GPIO_GPGINV_GPIO208   0x10000U      // Input inversion control for this pin
#define GPIO_GPGINV_GPIO209   0x20000U      // Input inversion control for this pin
#define GPIO_GPGINV_GPIO210   0x40000U      // Input inversion control for this pin
#define GPIO_GPGINV_GPIO211   0x80000U      // Input inversion control for this pin
#define GPIO_GPGINV_GPIO212   0x100000U     // Input inversion control for this pin
#define GPIO_GPGINV_GPIO213   0x200000U     // Input inversion control for this pin
#define GPIO_GPGINV_GPIO219   0x8000000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO220   0x10000000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO221   0x20000000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO222   0x40000000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO223   0x80000000U   // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGODR register
//
//*************************************************************************************************
#define GPIO_GPGODR_GPIO219   0x8000000U    // Outpout Open-Drain control for this pin
#define GPIO_GPGODR_GPIO220   0x10000000U   // Outpout Open-Drain control for this pin
#define GPIO_GPGODR_GPIO221   0x20000000U   // Outpout Open-Drain control for this pin
#define GPIO_GPGODR_GPIO222   0x40000000U   // Outpout Open-Drain control for this pin
#define GPIO_GPGODR_GPIO223   0x80000000U   // Outpout Open-Drain control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGAMSEL register
//
//*************************************************************************************************
#define GPIO_GPGAMSEL_GPIO192   0x1U        // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO193   0x2U        // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO194   0x4U        // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO195   0x8U        // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO196   0x10U       // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO197   0x20U       // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO198   0x40U       // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO199   0x80U       // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO200   0x100U      // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO201   0x200U      // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO202   0x400U      // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO203   0x800U      // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO204   0x1000U     // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO205   0x2000U     // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO206   0x4000U     // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO207   0x8000U     // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO208   0x10000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO209   0x20000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO210   0x40000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO211   0x80000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO212   0x100000U   // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO213   0x200000U   // Analog Mode select for this pin

