TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPGGMUX1_GPIO192_S   0U
#define GPIO_GPGGMUX1_GPIO192_M   0x3U          // Defines pin-muxing selection for GPIO192
#define GPIO_GPGGMUX1_GPIO193_S   2U
#define GPIO_GPGGMUX1_GPIO193_M   0xCU          // Defines pin-muxing selection for GPIO193
#define GPIO_GPGGMUX1_GPIO194_S   4U
#define GPIO_GPGGMUX1_GPIO194_M   0x30U         // Defines pin-muxing selection for GPIO194
#define GPIO_GPGGMUX1_GPIO195_S   6U
#define GPIO_GPGGMUX1_GPIO195_M   0xC0U         // Defines pin-muxing selection for GPIO195
#define GPIO_GPGGMUX1_GPIO196_S   8U
#define GPIO_GPGGMUX1_GPIO196_M   0x300U        // Defines pin-muxing selection for GPIO196
#define GPIO_GPGGMUX1_GPIO197_S   10U
#define GPIO_GPGGMUX1_GPIO197_M   0xC00U        // Defines pin-muxing selection for GPIO197
#define GPIO_GPGGMUX1_GPIO198_S   12U
#define GPIO_GPGGMUX1_GPIO198_M   0x3000U       // Defines pin-muxing selection for GPIO198
#define GPIO_GPGGMUX1_GPIO199_S   14U
#define GPIO_GPGGMUX1_GPIO199_M   0xC000U       // Defines pin-muxing selection for GPIO199
#define GPIO_GPGGMUX1_GPIO200_S   16U
#define GPIO_GPGGMUX1_GPIO200_M   0x30000U      // Defines pin-muxing selection for GPIO200
#define GPIO_GPGGMUX1_GPIO201_S   18U
#define GPIO_GPGGMUX1_GPIO201_M   0xC0000U      // Defines pin-muxing selection for GPIO201
#define GPIO_GPGGMUX1_GPIO202_S   20U
#define GPIO_GPGGMUX1_GPIO202_M   0x300000U     // Defines pin-muxing selection for GPIO202
#define GPIO_GPGGMUX1_GPIO203_S   22U
#define GPIO_GPGGMUX1_GPIO203_M   0xC00000U     // Defines pin-muxing selection for GPIO203
#define GPIO_GPGGMUX1_GPIO204_S   24U
#define GPIO_GPGGMUX1_GPIO204_M   0x3000000U    // Defines pin-muxing selection for GPIO204
#define GPIO_GPGGMUX1_GPIO205_S   26U
#define GPIO_GPGGMUX1_GPIO205_M   0xC000000U    // Defines pin-muxing selection for GPIO205
#define GPIO_GPGGMUX1_GPIO206_S   28U
#define GPIO_GPGGMUX1_GPIO206_M   0x30000000U   // Defines pin-muxing selection for GPIO206
#define GPIO_GPGGMUX1_GPIO207_S   30U
#define GPIO_GPGGMUX1_GPIO207_M   0xC0000000U   // Defines pin-muxing selection for GPIO207

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPGGMUX2_GPIO208_S   0U
#define GPIO_GPGGMUX2_GPIO208_M   0x3U          // Defines pin-muxing selection for GPIO208
#define GPIO_GPGGMUX2_GPIO209_S   2U
#define GPIO_GPGGMUX2_GPIO209_M   0xCU          // Defines pin-muxing selection for GPIO209
#define GPIO_GPGGMUX2_GPIO210_S   4U
#define GPIO_GPGGMUX2_GPIO210_M   0x30U         // Defines pin-muxing selection for GPIO210
#define GPIO_GPGGMUX2_GPIO211_S   6U
#define GPIO_GPGGMUX2_GPIO211_M   0xC0U         // Defines pin-muxing selection for GPIO211
#define GPIO_GPGGMUX2_GPIO212_S   8U
#define GPIO_GPGGMUX2_GPIO212_M   0x300U        // Defines pin-muxing selection for GPIO212
#define GPIO_GPGGMUX2_GPIO213_S   10U
#define GPIO_GPGGMUX2_GPIO213_M   0xC00U        // Defines pin-muxing selection for GPIO213
#define GPIO_GPGGMUX2_GPIO219_S   22U
#define GPIO_GPGGMUX2_GPIO219_M   0xC00000U     // Defines pin-muxing selection for GPIO219
#define GPIO_GPGGMUX2_GPIO220_S   24U
#define GPIO_GPGGMUX2_GPIO220_M   0x3000000U    // Defines pin-muxing selection for GPIO220
#define GPIO_GPGGMUX2_GPIO221_S   26U
#define GPIO_GPGGMUX2_GPIO221_M   0xC000000U    // Defines pin-muxing selection for GPIO221
#define GPIO_GPGGMUX2_GPIO222_S   28U
#define GPIO_GPGGMUX2_GPIO222_M   0x30000000U   // Defines pin-muxing selection for GPIO222
#define GPIO_GPGGMUX2_GPIO223_S   30U
#define GPIO_GPGGMUX2_GPIO223_M   0xC0000000U   // Defines pin-muxing selection for GPIO223

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL1 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL1_GPIO192_S   0U
#define GPIO_GPGCSEL1_GPIO192_M   0xFU          // GPIO192 Controller CPU Select
#define GPIO_GPGCSEL1_GPIO193_S   4U
#define GPIO_GPGCSEL1_GPIO193_M   0xF0U         // GPIO193 Controller CPU Select
#define GPIO_GPGCSEL1_GPIO194_S   8U
#define GPIO_GPGCSEL1_GPIO194_M   0xF00U        // GPIO194 Controller CPU Select
#define GPIO_GPGCSEL1_GPIO195_S   12U
#define GPIO_GPGCSEL1_GPIO195_M   0xF000U       // GPIO195 Controller CPU Select
#define GPIO_GPGCSEL1_GPIO196_S   16U
#define GPIO_GPGCSEL1_GPIO196_M   0xF0000U      // GPIO196 Controller CPU Select
#define GPIO_GPGCSEL1_GPIO197_S   20U
#define GPIO_GPGCSEL1_GPIO197_M   0xF00000U     // GPIO197 Controller CPU Select
#define GPIO_GPGCSEL1_GPIO198_S   24U
#define GPIO_GPGCSEL1_GPIO198_M   0xF000000U    // GPIO198 Controller CPU Select
#define GPIO_GPGCSEL1_GPIO199_S   28U
#define GPIO_GPGCSEL1_GPIO199_M   0xF0000000U   // GPIO199 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL2 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL2_GPIO200_S   0U
#define GPIO_GPGCSEL2_GPIO200_M   0xFU          // GPIO200 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO201_S   4U
#define GPIO_GPGCSEL2_GPIO201_M   0xF0U         // GPIO201 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO202_S   8U
#define GPIO_GPGCSEL2_GPIO202_M   0xF00U        // GPIO202 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO203_S   12U
#define GPIO_GPGCSEL2_GPIO203_M   0xF000U       // GPIO203 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO204_S   16U
#define GPIO_GPGCSEL2_GPIO204_M   0xF0000U      // GPIO204 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO205_S   20U
#define GPIO_GPGCSEL2_GPIO205_M   0xF00000U     // GPIO205 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO206_S   24U
#define GPIO_GPGCSEL2_GPIO206_M   0xF000000U    // GPIO206 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO207_S   28U
#define GPIO_GPGCSEL2_GPIO207_M   0xF0000000U   // GPIO207 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL3 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL3_GPIO208_S   0U
#define GPIO_GPGCSEL3_GPIO208_M   0xFU        // GPIO208 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO209_S   4U
#define GPIO_GPGCSEL3_GPIO209_M   0xF0U       // GPIO209 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO210_S   8U
#define GPIO_GPGCSEL3_GPIO210_M   0xF00U      // GPIO210 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO211_S   12U
#define GPIO_GPGCSEL3_GPIO211_M   0xF000U     // GPIO211 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO212_S   16U
#define GPIO_GPGCSEL3_GPIO212_M   0xF0000U    // GPIO212 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO213_S   20U
#define GPIO_GPGCSEL3_GPIO213_M   0xF00000U   // GPIO213 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL4 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL4_GPIO219_S   12U
#define GPIO_GPGCSEL4_GPIO219_M   0xF000U       // GPIO219 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO220_S   16U
#define GPIO_GPGCSEL4_GPIO220_M   0xF0000U      // GPIO220 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO221_S   20U
#define GPIO_GPGCSEL4_GPIO221_M   0xF00000U     // GPIO221 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO222_S   24U
#define GPIO_GPGCSEL4_GPIO222_M   0xF000000U    // GPIO222 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO223_S   28U
#define GPIO_GPGCSEL4_GPIO223_M   0xF0000000U   // GPIO223 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGLOCK register
//
//*************************************************************************************************
#define GPIO_GPGLOCK_GPIO192   0x1U          // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO193   0x2U          // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO194   0x4U          // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO195   0x8U          // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO196   0x10U         // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO197   0x20U         // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO198   0x40U         // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO199   0x80U         // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO200   0x100U        // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO201   0x200U        // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO202   0x400U        // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO203   0x800U        // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO204   0x1000U       // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO205   0x2000U       // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO206   0x4000U       // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO207   0x8000U       // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO208   0x10000U      // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO209   0x20000U      // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO210   0x40000U      // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO211   0x80000U      // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO212   0x100000U     // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO213   0x200000U     // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO219   0x8000000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO220   0x10000000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO221   0x20000000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO222   0x40000000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO223   0x80000000U   // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCR register
//
//*************************************************************************************************
#define GPIO_GPGCR_GPIO192   0x1U          // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO193   0x2U          // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO194   0x4U          // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO195   0x8U          // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO196   0x10U         // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO197   0x20U         // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO198   0x40U         // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO199   0x80U         // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO200   0x100U        // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO201   0x200U        // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO202   0x400U        // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO203   0x800U        // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO204   0x1000U       // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO205   0x2000U       // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO206   0x4000U       // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO207   0x8000U       // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO208   0x10000U      // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO209   0x20000U      // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO210   0x40000U      // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO211   0x80000U      // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO212   0x100000U     // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO213   0x200000U     // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO219   0x8000000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO220   0x10000000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO221   0x20000000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO222   0x40000000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO223   0x80000000U   // Configuration lock commit bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCTRL register
//
//*************************************************************************************************
#define GPIO_GPHCTRL_QUALPRD0_S   0U
#define GPIO_GPHCTRL_QUALPRD0_M   0xFFU         // Qualification sampling period for GPIO224 to
                                                // GPIO231
#define GPIO_GPHCTRL_QUALPRD1_S   8U
#define GPIO_GPHCTRL_QUALPRD1_M   0xFF00U       // Qualification sampling period for GPIO232 to
                                                // GPIO239
#define GPIO_GPHCTRL_QUALPRD2_S   16U
#define GPIO_GPHCTRL_QUALPRD2_M   0xFF0000U     // Qualification sampling period for GPIO240 to
                                                // GPIO247
#define GPIO_GPHCTRL_QUALPRD3_S   24U
#define GPIO_GPHCTRL_QUALPRD3_M   0xFF000000U   // Qualification sampling period for GPIO248 to
                                                // GPIO255

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHQSEL1 register
//
//*************************************************************************************************
#define GPIO_GPHQSEL1_GPIO224_S   0U
#define GPIO_GPHQSEL1_GPIO224_M   0x3U          // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO225_S   2U
#define GPIO_GPHQSEL1_GPIO225_M   0xCU          // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO226_S   4U
#define GPIO_GPHQSEL1_GPIO226_M   0x30U         // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO227_S   6U
#define GPIO_GPHQSEL1_GPIO227_M   0xC0U         // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO228_S   8U
#define GPIO_GPHQSEL1_GPIO228_M   0x300U        // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO229_S   10U
#define GPIO_GPHQSEL1_GPIO229_M   0xC00U        // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO230_S   12U
#define GPIO_GPHQSEL1_GPIO230_M   0x3000U       // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO231_S   14U
#define GPIO_GPHQSEL1_GPIO231_M   0xC000U       // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO232_S   16U
#define GPIO_GPHQSEL1_GPIO232_M   0x30000U      // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO233_S   18U
#define GPIO_GPHQSEL1_GPIO233_M   0xC0000U      // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO234_S   20U
#define GPIO_GPHQSEL1_GPIO234_M   0x300000U     // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO235_S   22U
#define GPIO_GPHQSEL1_GPIO235_M   0xC00000U     // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO236_S   24U
#define GPIO_GPHQSEL1_GPIO236_M   0x3000000U    // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO237_S   26U
#define GPIO_GPHQSEL1_GPIO237_M   0xC000000U    // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO238_S   28U
#define GPIO_GPHQSEL1_GPIO238_M   0x30000000U   // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO239_S   30U
#define GPIO_GPHQSEL1_GPIO239_M   0xC0000000U   // Select input qualification type for this GPIO
                                                // Pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPHQSEL2_GPIO240_S   0U
#define GPIO_GPHQSEL2_GPIO240_M   0x3U       // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO241_S   2U
#define GPIO_GPHQSEL2_GPIO241_M   0xCU       // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO242_S   4U
#define GPIO_GPHQSEL2_GPIO242_M   0x30U      // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO243_S   6U
#define GPIO_GPHQSEL2_GPIO243_M   0xC0U      // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO244_S   8U
#define GPIO_GPHQSEL2_GPIO244_M   0x300U     // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO245_S   10U
#define GPIO_GPHQSEL2_GPIO245_M   0xC00U     // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO246_S   12U
#define GPIO_GPHQSEL2_GPIO246_M   0x3000U    // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO247_S   14U
#define GPIO_GPHQSEL2_GPIO247_M   0xC000U    // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO248_S   16U
#define GPIO_GPHQSEL2_GPIO248_M   0x30000U   // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO249_S   18U
#define GPIO_GPHQSEL2_GPIO249_M   0xC0000U   // Select input qualification type for this GPIO Pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHMUX1 register
//
//*************************************************************************************************
#define GPIO_GPHMUX1_GPIO224_S   0U
#define GPIO_GPHMUX1_GPIO224_M   0x3U          // Defines pin-muxing selection for GPIO224
#define GPIO_GPHMUX1_GPIO225_S   2U
#define GPIO_GPHMUX1_GPIO225_M   0xCU          // Defines pin-muxing selection for GPIO225
#define GPIO_GPHMUX1_GPIO226_S   4U
#define GPIO_GPHMUX1_GPIO226_M   0x30U         // Defines pin-muxing selection for GPIO226
#define GPIO_GPHMUX1_GPIO227_S   6U
#define GPIO_GPHMUX1_GPIO227_M   0xC0U         // Defines pin-muxing selection for GPIO227
#define GPIO_GPHMUX1_GPIO228_S   8U
#define GPIO_GPHMUX1_GPIO228_M   0x300U        // Defines pin-muxing selection for GPIO228
#define GPIO_GPHMUX1_GPIO229_S   10U
#define GPIO_GPHMUX1_GPIO229_M   0xC00U        // Defines pin-muxing selection for GPIO229
#define GPIO_GPHMUX1_GPIO230_S   12U
#define GPIO_GPHMUX1_GPIO230_M   0x3000U       // Defines pin-muxing selection for GPIO230
#define GPIO_GPHMUX1_GPIO231_S   14U
#define GPIO_GPHMUX1_GPIO231_M   0xC000U       // Defines pin-muxing selection for GPIO231
#define GPIO_GPHMUX1_GPIO232_S   16U
#define GPIO_GPHMUX1_GPIO232_M   0x30000U      // Defines pin-muxing selection for GPIO232
#define GPIO_GPHMUX1_GPIO233_S   18U
#define GPIO_GPHMUX1_GPIO233_M   0xC0000U      // Defines pin-muxing selection for GPIO233
#define GPIO_GPHMUX1_GPIO234_S   20U
#define GPIO_GPHMUX1_GPIO234_M   0x300000U     // Defines pin-muxing selection for GPIO234
#define GPIO_GPHMUX1_GPIO235_S   22U
#define GPIO_GPHMUX1_GPIO235_M   0xC00000U     // Defines pin-muxing selection for GPIO235
#define GPIO_GPHMUX1_GPIO236_S   24U
#define GPIO_GPHMUX1_GPIO236_M   0x3000000U    // Defines pin-muxing selection for GPIO236
#define GPIO_GPHMUX1_GPIO237_S   26U
#define GPIO_GPHMUX1_GPIO237_M   0xC000000U    // Defines pin-muxing selection for GPIO237
#define GPIO_GPHMUX1_GPIO238_S   28U
#define GPIO_GPHMUX1_GPIO238_M   0x30000000U   // Defines pin-muxing selection for GPIO238
#define GPIO_GPHMUX1_GPIO239_S   30U
#define GPIO_GPHMUX1_GPIO239_M   0xC0000000U   // Defines pin-muxing selection for GPIO239

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHMUX2 register
//
//*************************************************************************************************
#define GPIO_GPHMUX2_GPIO240_S   0U
#define GPIO_GPHMUX2_GPIO240_M   0x3U       // Defines pin-muxing selection for GPIO240
#define GPIO_GPHMUX2_GPIO241_S   2U
#define GPIO_GPHMUX2_GPIO241_M   0xCU       // Defines pin-muxing selection for GPIO241
#define GPIO_GPHMUX2_GPIO242_S   4U
#define GPIO_GPHMUX2_GPIO242_M   0x30U      // Defines pin-muxing selection for GPIO242
#define GPIO_GPHMUX2_GPIO243_S   6U
#define GPIO_GPHMUX2_GPIO243_M   0xC0U      // Defines pin-muxing selection for GPIO243
#define GPIO_GPHMUX2_GPIO244_S   8U
#define GPIO_GPHMUX2_GPIO244_M   0x300U     // Defines pin-muxing selection for GPIO244
#define GPIO_GPHMUX2_GPIO245_S   10U
#define GPIO_GPHMUX2_GPIO245_M   0xC00U     // Defines pin-muxing selection for GPIO245
#define GPIO_GPHMUX2_GPIO246_S   12U
#define GPIO_GPHMUX2_GPIO246_M   0x3000U    // Defines pin-muxing selection for GPIO246
#define GPIO_GPHMUX2_GPIO247_S   14U
#define GPIO_GPHMUX2_GPIO247_M   0xC000U    // Defines pin-muxing selection for GPIO247
#define GPIO_GPHMUX2_GPIO248_S   16U
#define GPIO_GPHMUX2_GPIO248_M   0x30000U   // Defines pin-muxing selection for GPIO248
#define GPIO_GPHMUX2_GPIO249_S   18U
#define GPIO_GPHMUX2_GPIO249_M   0xC0000U   // Defines pin-muxing selection for GPIO249

