TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPDDIR register
//
//*************************************************************************************************
#define GPIO_GPDDIR_GPIO96    0x1U          // Defines direction for this pin in GPIO mode
#define GPIO_GPDDIR_GPIO97    0x2U          // Defines direction for this pin in GPIO mode
#define GPIO_GPDDIR_GPIO98    0x4U          // Defines direction for this pin in GPIO mode
#define GPIO_GPDDIR_GPIO99    0x8U          // Defines direction for this pin in GPIO mode
#define GPIO_GPDDIR_GPIO100   0x10U         // Defines direction for this pin in GPIO mode
#define GPIO_GPDDIR_GPIO101   0x20U         // Defines direction for this pin in GPIO mode
#define GPIO_GPDDIR_GPIO103   0x80U         // Defines direction for this pin in GPIO mode
#define GPIO_GPDDIR_GPIO105   0x200U        // Defines direction for this pin in GPIO mode
#define GPIO_GPDDIR_GPIO127   0x80000000U   // Defines direction for this pin in GPIO mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFDAT register
//
//*************************************************************************************************
#define GPIO_GPFDAT_GPIO160   0x1U          // Data Register for this pin
#define GPIO_GPFDAT_GPIO161   0x2U          // Data Register for this pin
#define GPIO_GPFDAT_GPIO162   0x4U          // Data Register for this pin
#define GPIO_GPFDAT_GPIO163   0x8U          // Data Register for this pin
#define GPIO_GPFDAT_GPIO164   0x10U         // Data Register for this pin
#define GPIO_GPFDAT_GPIO165   0x20U         // Data Register for this pin
#define GPIO_GPFDAT_GPIO166   0x40U         // Data Register for this pin
#define GPIO_GPFDAT_GPIO167   0x80U         // Data Register for this pin
#define GPIO_GPFDAT_GPIO168   0x100U        // Data Register for this pin
#define GPIO_GPFDAT_GPIO169   0x200U        // Data Register for this pin
#define GPIO_GPFDAT_GPIO170   0x400U        // Data Register for this pin
#define GPIO_GPFDAT_GPIO171   0x800U        // Data Register for this pin
#define GPIO_GPFDAT_GPIO172   0x1000U       // Data Register for this pin
#define GPIO_GPFDAT_GPIO173   0x2000U       // Data Register for this pin
#define GPIO_GPFDAT_GPIO174   0x4000U       // Data Register for this pin
#define GPIO_GPFDAT_GPIO175   0x8000U       // Data Register for this pin
#define GPIO_GPFDAT_GPIO176   0x10000U      // Data Register for this pin
#define GPIO_GPFDAT_GPIO177   0x20000U      // Data Register for this pin
#define GPIO_GPFDAT_GPIO178   0x40000U      // Data Register for this pin
#define GPIO_GPFDAT_GPIO179   0x80000U      // Data Register for this pin
#define GPIO_GPFDAT_GPIO180   0x100000U     // Data Register for this pin
#define GPIO_GPFDAT_GPIO181   0x200000U     // Data Register for this pin
#define GPIO_GPFDAT_GPIO182   0x400000U     // Data Register for this pin
#define GPIO_GPFDAT_GPIO183   0x800000U     // Data Register for this pin
#define GPIO_GPFDAT_GPIO184   0x1000000U    // Data Register for this pin
#define GPIO_GPFDAT_GPIO185   0x2000000U    // Data Register for this pin
#define GPIO_GPFDAT_GPIO186   0x4000000U    // Data Register for this pin
#define GPIO_GPFDAT_GPIO187   0x8000000U    // Data Register for this pin
#define GPIO_GPFDAT_GPIO188   0x10000000U   // Data Register for this pin
#define GPIO_GPFDAT_GPIO189   0x20000000U   // Data Register for this pin
#define GPIO_GPFDAT_GPIO190   0x40000000U   // Data Register for this pin
#define GPIO_GPFDAT_GPIO191   0x80000000U   // Data Register for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGDAT register
//
//*************************************************************************************************
#define GPIO_GPGDAT_GPIO192   0x1U          // Data Register for this pin
#define GPIO_GPGDAT_GPIO193   0x2U          // Data Register for this pin
#define GPIO_GPGDAT_GPIO194   0x4U          // Data Register for this pin
#define GPIO_GPGDAT_GPIO195   0x8U          // Data Register for this pin
#define GPIO_GPGDAT_GPIO196   0x10U         // Data Register for this pin
#define GPIO_GPGDAT_GPIO197   0x20U         // Data Register for this pin
#define GPIO_GPGDAT_GPIO198   0x40U         // Data Register for this pin
#define GPIO_GPGDAT_GPIO199   0x80U         // Data Register for this pin
#define GPIO_GPGDAT_GPIO200   0x100U        // Data Register for this pin
#define GPIO_GPGDAT_GPIO201   0x200U        // Data Register for this pin
#define GPIO_GPGDAT_GPIO202   0x400U        // Data Register for this pin
#define GPIO_GPGDAT_GPIO203   0x800U        // Data Register for this pin
#define GPIO_GPGDAT_GPIO204   0x1000U       // Data Register for this pin
#define GPIO_GPGDAT_GPIO205   0x2000U       // Data Register for this pin
#define GPIO_GPGDAT_GPIO206   0x4000U       // Data Register for this pin
#define GPIO_GPGDAT_GPIO207   0x8000U       // Data Register for this pin
#define GPIO_GPGDAT_GPIO208   0x10000U      // Data Register for this pin
#define GPIO_GPGDAT_GPIO209   0x20000U      // Data Register for this pin
#define GPIO_GPGDAT_GPIO210   0x40000U      // Data Register for this pin
#define GPIO_GPGDAT_GPIO211   0x80000U      // Data Register for this pin
#define GPIO_GPGDAT_GPIO212   0x100000U     // Data Register for this pin
#define GPIO_GPGDAT_GPIO213   0x200000U     // Data Register for this pin
#define GPIO_GPGDAT_GPIO219   0x8000000U    // Data Register for this pin
#define GPIO_GPGDAT_GPIO220   0x10000000U   // Data Register for this pin
#define GPIO_GPGDAT_GPIO221   0x20000000U   // Data Register for this pin
#define GPIO_GPGDAT_GPIO222   0x40000000U   // Data Register for this pin
#define GPIO_GPGDAT_GPIO223   0x80000000U   // Data Register for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGSET register
//
//*************************************************************************************************
#define GPIO_GPGSET_GPIO219   0x8000000U    // Output Set bit for this pin
#define GPIO_GPGSET_GPIO220   0x10000000U   // Output Set bit for this pin
#define GPIO_GPGSET_GPIO221   0x20000000U   // Output Set bit for this pin
#define GPIO_GPGSET_GPIO222   0x40000000U   // Output Set bit for this pin
#define GPIO_GPGSET_GPIO223   0x80000000U   // Output Set bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCLEAR register
//
//*************************************************************************************************
#define GPIO_GPGCLEAR_GPIO219   0x8000000U    // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO220   0x10000000U   // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO221   0x20000000U   // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO222   0x40000000U   // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO223   0x80000000U   // Output Clear bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPGTOGGLE_GPIO219   0x8000000U    // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO220   0x10000000U   // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO221   0x20000000U   // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO222   0x40000000U   // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO223   0x80000000U   // Output Toggle bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGDIR register
//
//*************************************************************************************************
#define GPIO_GPGDIR_GPIO219   0x8000000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO220   0x10000000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO221   0x20000000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO222   0x40000000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO223   0x80000000U   // Defines direction for this pin in GPIO mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHDAT register
//
//*************************************************************************************************
#define GPIO_GPHDAT_GPIO224   0x1U         // Data Register for this pin
#define GPIO_GPHDAT_GPIO225   0x2U         // Data Register for this pin
#define GPIO_GPHDAT_GPIO226   0x4U         // Data Register for this pin
#define GPIO_GPHDAT_GPIO227   0x8U         // Data Register for this pin
#define GPIO_GPHDAT_GPIO228   0x10U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO229   0x20U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO230   0x40U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO231   0x80U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO232   0x100U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO233   0x200U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO234   0x400U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO235   0x800U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO236   0x1000U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO237   0x2000U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO238   0x4000U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO239   0x8000U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO240   0x10000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO241   0x20000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO242   0x40000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO243   0x80000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO244   0x100000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO245   0x200000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO246   0x400000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO247   0x800000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO248   0x1000000U   // Data Register for this pin
#define GPIO_GPHDAT_GPIO249   0x2000000U   // Data Register for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHSET register
//
//*************************************************************************************************
#define GPIO_GPHSET_GPIO224   0x1U         // Output Set bit for this pin
#define GPIO_GPHSET_GPIO225   0x2U         // Output Set bit for this pin
#define GPIO_GPHSET_GPIO226   0x4U         // Output Set bit for this pin
#define GPIO_GPHSET_GPIO227   0x8U         // Output Set bit for this pin
#define GPIO_GPHSET_GPIO228   0x10U        // Output Set bit for this pin
#define GPIO_GPHSET_GPIO229   0x20U        // Output Set bit for this pin
#define GPIO_GPHSET_GPIO230   0x40U        // Output Set bit for this pin
#define GPIO_GPHSET_GPIO231   0x80U        // Output Set bit for this pin
#define GPIO_GPHSET_GPIO232   0x100U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO233   0x200U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO234   0x400U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO235   0x800U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO236   0x1000U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO237   0x2000U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO238   0x4000U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO239   0x8000U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO240   0x10000U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO241   0x20000U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO242   0x40000U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO243   0x80000U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO244   0x100000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO245   0x200000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO246   0x400000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO247   0x800000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO248   0x1000000U   // Output Set bit for this pin
#define GPIO_GPHSET_GPIO249   0x2000000U   // Output Set bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCLEAR register
//
//*************************************************************************************************
#define GPIO_GPHCLEAR_GPIO224   0x1U         // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO225   0x2U         // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO226   0x4U         // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO227   0x8U         // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO228   0x10U        // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO229   0x20U        // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO230   0x40U        // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO231   0x80U        // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO232   0x100U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO233   0x200U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO234   0x400U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO235   0x800U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO236   0x1000U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO237   0x2000U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO238   0x4000U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO239   0x8000U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO240   0x10000U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO241   0x20000U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO242   0x40000U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO243   0x80000U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO244   0x100000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO245   0x200000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO246   0x400000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO247   0x800000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO248   0x1000000U   // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO249   0x2000000U   // Output Clear bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPHTOGGLE_GPIO224   0x1U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO225   0x2U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO226   0x4U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO227   0x8U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO228   0x10U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO229   0x20U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO230   0x40U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO231   0x80U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO232   0x100U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO233   0x200U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO234   0x400U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO235   0x800U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO236   0x1000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO237   0x2000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO238   0x4000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO239   0x8000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO240   0x10000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO241   0x20000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO242   0x40000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO243   0x80000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO244   0x100000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO245   0x200000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO246   0x400000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO247   0x800000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO248   0x1000000U   // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO249   0x2000000U   // Output Toggle bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHDIR register
//
//*************************************************************************************************
#define GPIO_GPHDIR_GPIO224   0x1U         // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO225   0x2U         // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO226   0x4U         // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO227   0x8U         // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO228   0x10U        // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO229   0x20U        // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO230   0x40U        // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO231   0x80U        // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO232   0x100U       // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO233   0x200U       // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO234   0x400U       // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO235   0x800U       // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO236   0x1000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO237   0x2000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO238   0x4000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO239   0x8000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO240   0x10000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO241   0x20000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO242   0x40000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO243   0x80000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO244   0x100000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO245   0x200000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO246   0x400000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO247   0x800000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO248   0x1000000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO249   0x2000000U   // Defines direction for this pin in GPIO mode




#endif
